In [54]:
import requests
import csv
from bs4 import BeautifulSoup as bs
import pandas as pd

In [55]:
url = requests.get("https://en.wikipedia.org/wiki/Comma-separated_values")
soup = bs(url.content, 'html.parser')

In [56]:
filename = "python_csv.csv"
csv_writer = csv.writer(open(filename, 'w'))

In [57]:
car_table = soup.findAll('table', class_ = 'wikitable')[0]

In [58]:
car_table

<table class="wikitable">
<tbody><tr>
<th>Year</th>
<th>Make</th>
<th>Model</th>
<th>Description</th>
<th>Price
</th></tr>
<tr>
<td>1997</td>
<td>Ford</td>
<td>E350</td>
<td>ac, abs, moon</td>
<td>3000.00
</td></tr>
<tr>
<td>1999</td>
<td>Chevy</td>
<td>Venture "Extended Edition"</td>
<td></td>
<td>4900.00
</td></tr>
<tr>
<td>1999</td>
<td>Chevy</td>
<td>Venture "Extended Edition, Very Large"</td>
<td></td>
<td>5000.00
</td></tr>
<tr>
<td>1996</td>
<td>Jeep</td>
<td>Grand Cherokee</td>
<td>MUST SELL!<br/>air, moon roof, loaded</td>
<td>4799.00
</td></tr></tbody></table>

In [59]:
tr = car_table.findAll(['tr'])
tr

[<tr>
 <th>Year</th>
 <th>Make</th>
 <th>Model</th>
 <th>Description</th>
 <th>Price
 </th></tr>,
 <tr>
 <td>1997</td>
 <td>Ford</td>
 <td>E350</td>
 <td>ac, abs, moon</td>
 <td>3000.00
 </td></tr>,
 <tr>
 <td>1999</td>
 <td>Chevy</td>
 <td>Venture "Extended Edition"</td>
 <td></td>
 <td>4900.00
 </td></tr>,
 <tr>
 <td>1999</td>
 <td>Chevy</td>
 <td>Venture "Extended Edition, Very Large"</td>
 <td></td>
 <td>5000.00
 </td></tr>,
 <tr>
 <td>1996</td>
 <td>Jeep</td>
 <td>Grand Cherokee</td>
 <td>MUST SELL!<br/>air, moon roof, loaded</td>
 <td>4799.00
 </td></tr>]

In [60]:
csvFile = open('car.csv', 'wt', newline='', encoding='utf-8')
writer = csv.writer(csvFile)

try: 
    for cell in tr:
        th = cell.find_all('th')
        th_data =[col.text.strip('\n') for col in th]
        td = cell.find_all('td')
        row =[i.text.replace('\n','') for i in td]
        writer.writerow(th_data+row)
        
finally:
    csvFile.close()

In [61]:
df1 = pd.read_csv('car.csv')
df1

,Year,Make,Model,Description,Price
0,1997,Ford,E350,"ac, abs, moon",3000.0
1,1999,Chevy,"Venture ""Extended Edition""",NaN,4900.0
2,1999,Chevy,"Venture ""Extended Edition, Very Large""",NaN,5000.0
3,1996,Jeep,Grand Cherokee,"MUST SELL!air, moon roof, loaded",4799.0